yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/tim/inc/rtl_tim.h
/*
 * Copyright (c) 2026, Realtek Semiconductor Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*============================================================================*
 *               Define to prevent recursive inclusion
 *============================================================================*/
#ifndef RTL_TIM_H
#define RTL_TIM_H

#ifdef __cplusplus
extern "C" {
#endif

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "utils/rtl_utils.h"
#if defined (CONFIG_SOC_SERIES_RTL87X2G)
#include "tim/src/rtl87x2g/rtl_tim_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3E)
#include "tim/src/rtl87x3e/rtl_tim_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL87X3D)
#include "tim/src/rtl87x3d/rtl_tim_def.h"
#elif defined (CONFIG_SOC_SERIES_RTL8762J)
#include "tim/src/rtl87x2j/rtl_tim_def.h"
#endif

/** \defgroup TIM         TIM
  * \brief
  * \{
  */
/*============================================================================*
 *                         Constants
 *============================================================================*/
/** \defgroup TIM_Exported_Constants TIM Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup    PWM_DeadZone_Clock_Source PWM DeadZone Clock Source
 * \{
 * \ingroup     TIM_Exported_Constants
 */
typedef enum
{
    PWM_CK_5M_TIMER = 0x0,     //!< PWM DeadZone Clock Source is 5MHz.
    PWM_CK_32K_TIMER = 0x1,    //!< PWM DeadZone Clock Source is 32KHz.
} PWMDZClockSrc_TypeDef;

#define IS_TIM_PWM_DZ_SOURCE(PERIPH)     (((PERIPH) == PWM_CK_5M_TIMER) || \
                                          ((PERIPH) == PWM_CK_32K_TIMER)) //!< Check if the input parameter is valid.

/** End of PWM_DeadZone_Clock_Source
  * \}
  */

/**
 * \defgroup    TIM_Mode TIM Mode
 * \{
 * \ingroup     TIM_Exported_Constants
 */
typedef enum
{
    TIM_Mode_FreeRun = 0x0,      //!< Select the TIM mode as Free-running mode. In free-running mode, the TIM counts down from 0xFFFFFFFF.
    TIM_Mode_UserDefine = 0x1,   //!< Select the TIM mode as User-defined mode. In user-defined mode, the TIM counts down from the value set by TIM_Period in \ref TIM_TimeBaseInitTypeDef.
} TIMMode_TypeDef;

#define IS_TIM_MODE(mode) (((mode) == TIM_Mode_FreeRun) || \
                           ((mode) == TIM_Mode_UserDefine)) //!< Check if the input parameter is valid.

/** End of TIM_Mode
  * \}
  */

/**
 * \defgroup    PWM_DeadZone_Stop_State PWM DeadZone Stop State
 * \{
 * \ingroup     TIM_Exported_Constants
 */
typedef enum
{
    PWM_STOP_AT_LOW = 0x0,   //!< PWM DeadZone stop at low level.
    PWM_STOP_AT_HIGH = 0x1,  //!< PWM DeadZone stop at high level.
} PWMDZStopState_TypeDef;

#define IS_PWM_STOP_STATE(STATE) (((STATE) == PWM_STOP_AT_LOW) || \
                                  ((STATE) == PWM_STOP_AT_HIGH)) //!< Check if the input parameter is valid.

/** End of PWM_DeadZone_Stop_State
  * \}
  */

#if TIM_SUPPORT_EVENT_DURATION
/**
 * \brief       TIM_Event_Duration TIM Event Duration
 *
 * \ingroup     TIM_Exported_Constants
 */
typedef enum
{
    TIM_EventDuration_32us  = 0x00,   //!< The TIM event duration is 32us.
    TIM_EventDuration_64us  = 0x01,   //!< The TIM event duration is 64us.
    TIM_EventDuration_128us = 0x02,   //!< The TIM event duration is 128us.
    TIM_EventDuration_256us = 0x03,   //!< The TIM event duration is 256us.
} TIMEventDuration_TypeDef;

#define IS_TIM_Event_DURATION(duration) (((duration) == TIM_EventDuration_32us) || \
                                         ((duration) == TIM_EventDuration_64us) || \
                                         ((duration) == TIM_EventDuration_128us) || \
                                         ((duration) == TIM_EventDuration_256us)) //!< Check if the input parameter is valid.
#endif

/** End of TIM_Exported_Constants
  * \}
  */

/*============================================================================*
 *                         Types
 *============================================================================*/
/** \defgroup TIM_Exported_Types TIM Exported Types
  * \brief
  * \{
  */

/**
 * \brief       TIM init structure definition.
 *
 * \ingroup     TIM_Exported_Types
 */
typedef struct
{
    TIMClockSrc_TypeDef TIM_ClockSrc;          /*!< Specify the clock source.
                                                    This parameter can be a value of \ref TIM_Clock_Source.
                                                    The calculation formula for timer clock is as follows:
                                                    TIM clock = TIM_ClockSrc / TIM_SOURCE_DIV. */

    TIMClockDiv_TypeDef TIM_SOURCE_DIV;        /*!< Specify the clock source div.
                                                    This parameter can be a value of \ref TIM_Clock_Divider. */

    FunctionalState TIM_SOURCE_DIV_En;         /*!< Enable or disable timer source clock divider.
                                                    This parameter can be a value of DISABLE or ENABLE. */

    TIMMode_TypeDef TIM_Mode;                  /*!< Specify the counter mode.
                                                    This parameter can be a value of \ref TIM_Mode. */

    FunctionalState TIM_PWM_En;                /*!< Enable or disable the PWM mode.
                                                    This parameter can be a value of DISABLE or ENABLE. */

    uint32_t TIM_Period;                       /*!< Specify the period value to be loaded into the active
                                                    Auto-Reload Register at the next update event.
                                                    This parameter must range from 0x0 to 0xFFFFFFFF. */

    uint32_t TIM_PWM_High_Count;               /*!< Specify the PWM High Count.
                                                    This parameter must range from 0x0 to 0xFFFFFFFF.
                                                    PWM high period = (TIM_PWM_High_Count + 1) * TIM clock period.*/

