yue-leaf/damien0x0023-connectedhomeip/third_party/realtek/RTL87x2G-SDK-v1.7.0/bsp/driver/tim/inc/rtl_tim.h
    uint32_t TIM_PWM_Low_Count;                /*!< Specify the PWM Low Count.
                                                    This parameter must range from 0x0 to 0xFFFFFFFF.
                                                    PWM low period = (TIM_PWM_Low_Count + 1) * TIM clock period. */

#if TIM_SUPPORT_EVENT_DURATION
    uint32_t TIM_EventMode;                    /*!< Specify the TIM event mode. */

    uint32_t TIM_EventIndex;                   /*!< Specify the TIM event index. */

    uint32_t TIM_EventDuration;                /*!< Specify the TIM event duration. */
#endif

#if TIM_SUPPORT_CLOCK_DEPEND
    uint8_t  ClockDepend;                      /*!< Specify TIM Source depend.
                                                    timer3 depend timer2, timer5 depend timer4, timer7 depend timer6.
                                                    This parameter can be a value of ENABLE or DISABLE. */
#endif

    PWMDZClockSrc_TypeDef PWM_Deazone_ClockSrc;/*!< Specify the PWM deadzone clock source.
                                                    The calculation formula for PWM deadzone clock is as follows:
                                                    PWM deadzone clock = PWM_Deazone_ClockSrc / PWM_Deadzone_DIV.
                                                    This parameter can be a value of \ref PWM_DeadZone_Clock_Source. */

    TIMClockDiv_TypeDef PWM_Deadzone_DIV;      /*!< Specify the PWM deadzone clock divider.
                                                    This parameter can be a value of \ref TIM_Clock_Divider. */

    uint32_t PWM_Deazone_Size;                 /*!< Specify the PWM deadzone size.
                                                    This parameter must range from 0x1 to 0xff.
                                                    The calculation formula for deadzone time is as follows:
                                                    deadzone time = (PWM_Deazone_Size) / deadzone clock. */

    FunctionalState
    PWMDeadZone_En;                            /*!< Enable or disable the PWM complementary output and deadzone.
                                                    This parameter can be a value of ENABLE or DISABLE. */

    PWMDZStopState_TypeDef PWM_Stop_State_P;   /*!< Specify the PWM P stop state.
                                                    This parameter can be a value of \ref PWM_DeadZone_Stop_State. */

    PWMDZStopState_TypeDef PWM_Stop_State_N;   /*!< Specify the PWM N stop state.
                                                    This parameter can be a value of \ref PWM_DeadZone_Stop_State. */

} TIM_TimeBaseInitTypeDef;

/** End of TIM_Exported_Types
  * \}
  */

/*============================================================================*
 *                         Functions
 *============================================================================*/
/** \defgroup TIM_Exported_Functions TIM Exported Functions
  * \brief
  * \{
  */

/**
 * \brief   Deinitialize the specified TIMx registers to their default reset values.
 *
 * \param[in] TIMx  Select the TIM peripheral. Refer to \ref TIM_Declaration.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void timer_demo(void)
 * {
 *     TIM_DeInit(TIM6);
 * }
 * \endcode
 */
void TIM_DeInit(TIM_TypeDef *TIMx);

/**
 * \brief   Initialize the specified TIMx according to the specified parameters
 *          in TIM_TimeBaseInitStruct.
 *
 * \param[in] TIMx                    Select the TIM peripheral. Refer to \ref TIM_Declaration.
 * \param[in] TIM_TimeBaseInitStruct  Pointer to a TIM_TimeBaseInitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_timer_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_TIMER, APBPeriph_TIMER_CLOCK, ENABLE);
 *
 *     TIM_TimeBaseInitTypeDef TIM_InitStruct;
 *     TIM_StructInit(&TIM_InitStruct);
 *     TIM_InitStruct.TIM_PWM_En = DISABLE;
 *     TIM_InitStruct.TIM_Period = 1000000 - 1 ;
 *     TIM_InitStruct.TIM_Mode = TIM_Mode_UserDefine;
 *     TIM_TimeBaseInit(TIM6, &TIM_InitStruct);
 * }
 * \endcode
 */
void TIM_TimeBaseInit(TIM_TypeDef *TIMx, TIM_TimeBaseInitTypeDef *TIM_TimeBaseInitStruct);

/**
 * \brief   Fill each TIM_InitStruct member with its default value.
 *
 * \note The default settings for the TIM_InitStruct member are shown in the following table:
 *       | TIM_InitStruct member        | Default value                        |
 *       |:----------------------------:|:------------------------------------:|
 *       | TIM_ClockSrc                 | \ref TIM_CLOCK_SRC_40M               |
 *       | TIM_Mode                     | \ref TIM_Mode_UserDefine             |
 *       | TIM_Period                   | 0xfff                                |
 *       | TIM_SOURCE_DIV               | \ref TIM_CLOCK_DIVIDER_1             |
 *       | TIM_SOURCE_DIV_En            | DISABLE                              |
 *       | TIM_PWM_En                   | DISABLE                              |
 *       | PWM_Stop_State_P             | \ref PWM_STOP_AT_LOW                 |
 *       | PWM_Stop_State_N             | \ref PWM_STOP_AT_HIGH                |
 *       | PWMDeadZone_En               | DISABLE                              |
 *       | PWM_Deadzone_DIV             | \ref TIM_CLOCK_DIVIDER_1             |
 *       | PWM_Deazone_ClockSrc         | \ref PWM_CK_32K_TIMER                |
 *       | PWM_Deazone_Size             | 10                                   |
 *
 * \param[in] TIM_TimeBaseInitStruct  Pointer to a TIM_TimeBaseInitTypeDef structure which will be initialized.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_timer_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_TIMER, APBPeriph_TIMER_CLOCK, ENABLE);
 *
 *     TIM_TimeBaseInitTypeDef TIM_InitStruct;
 *     TIM_StructInit(&TIM_InitStruct);
 *     TIM_InitStruct.TIM_PWM_En = DISABLE;
 *     TIM_InitStruct.TIM_Period = 1000000 - 1;
 *     TIM_InitStruct.TIM_Mode = TIM_Mode_UserDefine;
 *     TIM_TimeBaseInit(TIM6, &TIM_InitStruct);
 * }
 * \endcode
 */
void TIM_StructInit(TIM_TimeBaseInitTypeDef *TIM_TimeBaseInitStruct);

/**
 * \brief   Enable or disable the specified TIMx peripheral.
 *
 * \param[in] TIMx      Select the TIM peripheral. Refer to \ref TIM_Declaration.
 * \param[in] NewState  New state of the TIMx peripheral.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Count start.
 *                      - DISABLE: Count stop and clear count value.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_timer_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_TIMER, APBPeriph_TIMER_CLOCK, ENABLE);
 *
 *     TIM_TimeBaseInitTypeDef TIM_InitStruct;
 *     TIM_StructInit(&TIM_InitStruct);
 *     TIM_InitStruct.TIM_PWM_En = DISABLE;
 *     TIM_InitStruct.TIM_Period = 1000000 - 1;
 *     TIM_InitStruct.TIM_Mode = TIM_Mode_UserDefine;
 *     TIM_TimeBaseInit(TIM6, &TIM_InitStruct);
 *     TIM_Cmd(TIM6, ENABLE);
 * }
 * \endcode
 */
void TIM_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState);

/**
 * \brief     Enable or disable the specified TIMx interrupt.
 *
 * \param[in] TIMx      Select the TIM peripheral. Refer to \ref TIM_Declaration.
 * \param[in] NewState  New state of the TIMx interrupt.
 *                      This parameter can be one of the following values:
 *                      - ENABLE: Enable the timeout interrupt.
 *                      - DISABLE: Disable the timeout interrupt.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_timer_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_TIMER, APBPeriph_TIMER_CLOCK, ENABLE);
 *
 *     TIM_TimeBaseInitTypeDef TIM_InitStruct;
 *     TIM_StructInit(&TIM_InitStruct);
 *     TIM_InitStruct.TIM_PWM_En = DISABLE;
 *     TIM_InitStruct.TIM_Period = 1000000 - 1;
 *     TIM_InitStruct.TIM_Mode = TIM_Mode_UserDefine;
 *     TIM_TimeBaseInit(TIM6, &TIM_InitStruct);
 *     TIM_ClearINT(TIM6);
 *     TIM_INTConfig(TIM6, ENABLE);
 * }
 * \endcode
 */
void TIM_INTConfig(TIM_TypeDef *TIMx, FunctionalState NewState);

/**
 * \brief     Change the specified TIMx period value.
 *
 * \param[in] TIMx    Select the TIM peripheral. Refer to \ref TIM_Declaration.
 * \param[in] period  Period value to be changed. This parameter must range from 0x0 to 0xFFFFFFFF.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void timer_demo(void)
 * {
 *     uint32_t new_period = 1000000 - 1;
 *     TIM_Cmd(TIM6, DISABLE);
 *     TIM_ChangePeriod(TIM6, new_period);
 * }
 * \endcode
 */
void TIM_ChangePeriod(TIM_TypeDef *TIMx, uint32_t period);

/**
 * \brief   Change the PWM frequency and duty cycle of the specified TIMx according to high_count and low_count.
 *
 * \param[in] TIMx        Select the TIM peripheral. Refer to \ref TIM_Declaration.
 * \param[in] high_count  This parameter must range from 0~0xFFFFFFFF.
 * \param[in] low_count   This parameter must range from be 0~0xFFFFFFFF.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * #define TIM_DEMO TIMB_6
 *
 * void timer_demo(void)
 * {
 *     uint32_t high_count = 1000000 - 1;
 *     uint32_t low_count = 1000000 - 1;
 *     TIM_Cmd(TIM_DEMO, DISABLE);
 *     TIM_ChangePeriod(TIM_DEMO, high_count, low_count);
 * }
 * \endcode
 */
void TIM_PWMChangeFreqAndDuty(TIM_TypeDef *TIMx, uint32_t high_count, uint32_t low_count);

/**
 * \brief   Get the specified TIMx current value when timer is running.
 *
 * \param[in] TIMx  Select the TIM peripheral. Refer to \ref TIM_Declaration.
 *
 * \return  The current counter value.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void timer_demo(void)
 * {
 *     uint32_t cur_value = TIM_GetCurrentValue(TIM6);
 * }
 * \endcode
 */
uint32_t TIM_GetCurrentValue(TIM_TypeDef *TIMx);

/**
 * \brief   Get the specified TIMx interrupt status.
 *
 * \param[in] TIMx  Select the TIM peripheral. Refer to \ref TIM_Declaration.
 *
 * \return  The NewState of the timer interrupt status.
 *          - SET: The TIM interrupt has occurred.
 *          - RESET: The TIM interrupt has not occurred.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void timer_demo(void)
 * {
 *     ITStatus int_status = TIM_GetINTStatus(TIM6);
 * }
 * \endcode
 */
ITStatus TIM_GetINTStatus(TIM_TypeDef *TIMx);

/**
 * \brief   Get the specified TIMx operation status.
 *
 * \param[in] TIMx  Select the TIM peripheral. Refer to \ref TIM_Declaration.
 *
 * \return  The NewState of the timer operation status.
 *          - SET: The timer is running.
 *          - RESET: The timer is not running.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void timer_demo(void)
 * {
 *     ITStatus intstatus = TIM_GetOperationStatus(TIM6);
 * }
 * \endcode
 */
ITStatus TIM_GetOperationStatus(TIM_TypeDef *TIMx);

/**
 * \brief Get the specified TIMx elapsed value when timer is running.
 *
 * \param[in] TIMx  Select the TIM peripheral. Refer to \ref TIM_Declaration.
 *
 * \return The elapsed counter value.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void timer_demo(void)
 * {
 *     uint32_t value = TIM_GetElapsedValue(TIM6);
 * }
 * \endcode
 */
uint32_t TIM_GetElapsedValue(TIM_TypeDef *TIMx);

/**
 * \brief   Clear the specified TIMx interrupt.
 *
 * \param[in] TIMx  Select the TIM peripheral. Refer to \ref TIM_Declaration.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void timer_demo(void)
 * {
 *     TIM_ClearINT(TIM6);
 * }
 * \endcode
 */
void TIM_ClearINT(TIM_TypeDef *TIMx);

/**
 * \brief   Enable or disable the emergency stop for PWM complementary output function.
 *
 * \param[in] PWMx      Select the PWM peripheral. Refer to \ref PWM_Declaration.
 * \param[in] NewState  NewState of complementary output.
 *                      \arg ENABLE: Enable the emergency stop output function.
 *                      \arg DISABLE: Disable the emergency stop output function.
 *
 * \note    When using PWM functions, it is crucial to pay attention to the corresponding relationships:
 *          PWM2 corresponds to TIM2, and PWM3 corresponds to TIM3.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void pwm_demo(void)
 * {
 *    board_pwm_init();
 *    driver_pwm_init();
 *    TIM_PWMComplOutputEMCmd(PWM2,ENABLE);
 * }
 * \endcode
 */
void TIM_PWMComplOutputEMCmd(PWM_TypeDef *PWMx, FunctionalState NewState);

/**
 * \brief   Enable or disable deadzone bypass for the PWM complementary output function.
 *          If enabled, PWM_P will become the inverse of PWM_N.
 *
 * \param[in] PWMx      Select the PWM peripheral. Refer to \ref PWM_Declaration.
 * \param[in] NewState  NewState of the PWMx peripheral.
 *                      \arg ENABLE: Enable bypass deadzone function.
 *                      \arg DISABLE: Disable bypass deadzone function.
 *
 * \note    When using PWM functions, it is crucial to pay attention to the corresponding relationships:
 *          PWM2 corresponds to TIM2, and PWM3 corresponds to TIM3.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_pwm_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_TIMER, APBPeriph_TIMER_CLOCK, ENABLE);
 *
 *     TIM_TimeBaseInitTypeDef TIM_InitStruct;
 *     TIM_StructInit(&TIM_InitStruct);
 *     TIM_InitStruct.TIM_Mode             = TIM_Mode_UserDefine;
 *     TIM_InitStruct.TIM_PWM_En           = ENABLE;
 *     TIM_InitStruct.TIM_PWM_High_Count   = PWM_HIGH_COUNT;
 *     TIM_InitStruct.TIM_PWM_Low_Count    = PWM_LOW_COUNT;
 *     TIM_InitStruct.PWM_Stop_State_P     = PWM_STOP_AT_HIGH;
 *     TIM_InitStruct.PWM_Stop_State_N     = PWM_STOP_AT_LOW;
 *     TIM_InitStruct.PWMDeadZone_En       = ENABLE;  //enable to use pwn p/n output
 *     TIM_InitStruct.PWM_Deazone_Size     = 255;
 *     TIM_TimeBaseInit(PWM2, &TIM_InitStruct);
 *
 *     TIM_Cmd(PWM2, ENABLE);
 *     TIM_PWMDZBypassCmd(PWM2, ENABLE);
 * }
 * \endcode
 */
void TIM_PWMDZBypassCmd(PWM_TypeDef *PWMx, FunctionalState NewState);

/**
 * \brief   Change the clock source for the PWM deadzone time.
 *
 * \param[in] PWMx                  Select the PWM peripheral. Refer to \ref PWM_Declaration.
 * \param[in] PWM_Deazone_ClockSrc  Specify the PWM deadzone clock source. Refer to \ref PWM_DeadZone_Clock_Source.
 *
 * \note    When using PWM functions, it is crucial to pay attention to the corresponding relationships:
 *          PWM2 corresponds to TIM2, and PWM3 corresponds to TIM3.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_pwm_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_TIMER, APBPeriph_TIMER_CLOCK, ENABLE);
 *     //Open 32k clock source.
 *     RCC_ClockSrc5MCmd();
 *
 *     TIM_TimeBaseInitTypeDef TIM_InitStruct;
 *
 *     TIM_StructInit(&TIM_InitStruct);
 *     TIM_InitStruct.TIM_Mode             = TIM_Mode_UserDefine;
 *     TIM_InitStruct.TIM_PWM_En           = ENABLE;
 *     TIM_InitStruct.TIM_PWM_High_Count   = PWM_HIGH_COUNT;
 *     TIM_InitStruct.TIM_PWM_Low_Count    = PWM_LOW_COUNT;
 *     TIM_InitStruct.PWM_Stop_State_P     = PWM_STOP_AT_HIGH;
 *     TIM_InitStruct.PWM_Stop_State_N     = PWM_STOP_AT_LOW;
 *     TIM_InitStruct.PWMDeadZone_En       = ENABLE;  //enable to use pwn p/n output
 *     TIM_InitStruct.PWM_Deazone_Size     = PWM_DEAD_ZONE_SIZE;
 *     TIM_TimeBaseInit(TIM2, &TIM_InitStruct);
 *
 *     //Use 32k clock source.
 *     TIM_PWMChangeDZClockSrc(TIM2, PWM_CK_32K_TIMER);
 *
 *     TIM_Cmd(TIM2, ENABLE);
 * }
 * \endcode
 */
void TIM_PWMChangeDZClockSrc(PWM_TypeDef *PWMx, PWMDZClockSrc_TypeDef PWM_Deazone_ClockSrc);

/**
 * \brief  Configure the specified TIMx clock.
 *
 * \param[in] TIMx      Select the TIM peripheral. Refer to \ref TIM_Declaration.
 * \param[in] ClockSrc  Specify the TIM clock source. Refer to \ref TIM_Clock_Source.
 * \param[in] ClockDiv  Specify the TIM clock divider. Refer to \ref TIM_Clock_Divider.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void timer_demo(void)
 * {
 *     TIM_ClkConfig(TIM6, TIM_CLOCK_SRC_40M, TIM_CLOCK_DIVIDER_1)
 * }
 * \endcode
 */
void TIM_ClkConfig(TIM_TypeDef *TIMx, TIMClockSrc_TypeDef ClockSrc,
                   TIMClockDiv_TypeDef ClockDiv);

/**
 * \brief  Get the specified TIMx clock configuration.
 *
 * \param[in]  TIMx      Select the TIM peripheral. Refer to \ref TIM_Declaration.
 * \param[out] ClockSrc  The TIM clock source. Refer to \ref TIM_Clock_Source.
 * \param[out] ClockDiv  The TIM clock divider. Refer to \ref TIM_Clock_Divider.
 *
 * \return The status of get clock.
 *         - true: TIM clock is set correctly.
 *         - false: The TIM clock is set incorrectly.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void timer_demo(void)
 * {
 *     TIMClockSrc_TypeDef clock_src;
 *     TIMClockDiv_TypeDef clock_div;
 *     TIM_ClkGet(TIM6, &clock_src, &clock_div);
 * }
 * \endcode
 */
bool TIM_ClkGet(TIM_TypeDef *TIMx, TIMClockSrc_TypeDef *ClockSrc, TIMClockDiv_TypeDef *ClockDiv);

#if RCC_SUPPORT_TIMSOURCECONFIG_API
/**
 * rtl876x_rcc.h
 *
 * \brief     Select the specified divider and source for the timer clock.
 *
 * \param[in] clocklevel   Timer clock divider.
 *                         This parameter can be one of the following values:
 *                         \arg TIM2TO7_CLOCK_DIV_x: TIM2TO7 clock divider, where x can be 1 ~ 4, 6, 8, 16.
 * \param[in] clocksource  Timer clock Source.
 *                         This parameter can be one of the following values:
 *                         \arg TIM_CLOCK_SOURCE_SYSTEM_CLOCK: Select timer clock source of system clock.
 *                         \arg TIM_CLOCK_SOURCE_40MHZ: Select timer clock source of 40MHz.
 *                         \arg TIM_CLOCK_SOURCE_PLL: Select timer clock source of PLL.
 * \param[in] NewState     New state of the specified RCC Clock Source.
 *                         This parameter can be one of the following values:
 *                         - ENABLE: Enable the specified RCC Clock Source.
 *                         - DISABLE: Disable the specified RCC Clock Source.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_xx_init(void)
 * {
 *     TIM_SourceConfig(TIM2TO7_CLOCK_DIV_1, TIM_CLOCK_SOURCE_40MHZ, ENABLE);
 * }
 * \endcode
 */
void TIM_SourceConfig(uint16_t clocklevel, uint16_t clocksource, FunctionalState NewState);
#endif

/** End of TIM_Exported_Functions
  * \}
  */

/** End of TIM
  * \}
  */

#ifdef __cplusplus
}
#endif

#endif /*_RTL_TIM_H_*/
